# Pandas Example 3

In [1]:
import pandas as pd
import numpy as np

In [11]:
s = pd.Series(np.random.randn(5))
print(s)

0    1.162517
1   -0.402633
2    1.689688
3   -1.077717
4    1.342710
dtype: float64

In [12]:
s = pd.Series(np.random.randn(5), index=['A','B','C','D','E'])
print(s)

A   -1.712565
B   -1.988386
C    0.111868
D    0.636893
E   -0.224770
dtype: float64

In [13]:
d={'a':0,'b':1,'c':2}
print(pd.Series(d))

a    0
b    1
c    2
dtype: int64

In [16]:
data2 = [
    {'name':'MARK'},
    {'name':'ERIC'},
    {'name':'JENNIFER'}
]
df2 = pd.DataFrame(data2)

In [17]:
df2

       name
0      MARK
1      ERIC
2  JENNIFER

In [18]:
df2['age'] = [10,11,12]
print(df2)

       name  age
0      MARK   10
1      ERIC   11
2  JENNIFER   12

In [19]:
df2

       name  age
0      MARK   10
1      ERIC   11
2  JENNIFER   12